whisper.cpp.sh

export http_proxy=http://172.28.32.1:10809
export https_proxy=http://172.28.32.1:10809


# android
mkdir build

cmake -B build -DCMAKE_BUILD_TYPE=Release \
      -DANDROID_ABI=arm64-v8a \
      -DANDROID_PLATFORM=android-21 \
      -DCMAKE_TOOLCHAIN_FILE=/app/ndk/build/cmake/android.toolchain.cmake \
      -DANDROID_NDK=/app/ndk

cmake --build build
# 


# windows
cmake -G "Visual Studio 17 2022" -A x64 -DCMAKE_BUILD_TYPE=Release ..
cmake --build . --config Release
# 


mkdir /app
cd /app
git clone https://github.com/ggerganov/whisper.cpp.git
cd whisper.cpp
sh ./models/download-ggml-model.sh base.en
make -j

./main -m models/ggml-base.en.bin -f /tmp/xy1.wav -l zh
apt install ffmpeg

# 转格式
apt install ffmpeg
ffmpeg -i /tmp/xy1.wav -ar 16000 -ac 1 /tmp/xy1_16k.wav


# 下载中文模型
sh ./models/download-ggml-model.sh base
./main -m models/ggml-base.bin -f /tmp/xy1_16k.wav -l zh


./main -m models/ggml-base.bin -l zh -f /tmp/xy1_16k.wav

./main -m models/ggml-base.bin -l zh -f output.wav

./main -m models/ggml-base.bin -l zh -f 0.wav -otxt -of output


# windows
./main -m ../../../models/ggml-base.bin -l zh -f 0.wav -otxt -of output



[00:00:00.000 --> 00:00:21.000]  秋天的清晨,陽光透過寶物,撒在遼闊的山野之間,空氣中夾雜著微涼的氣息,帶著些許樹葉的清香,換醒了還在沉睡的時間。
[00:00:21.000 --> 00:00:32.000]  山坡上,大片的草地,像一片綠色的海洋,微風吹過,當起層層波紋。
[00:00:32.000 --> 00:00:43.000]  草間上掛著露珠,在陽光的映射下,像無數顆經營的寶石閃爍著光灰。


[00:00:00.000 --> 00:00:03.800]  秋天的青沉
[00:00:03.800 --> 00:00:05.760]  陽光透過寶物
[00:00:05.760 --> 00:00:08.400]  撒在遼闊的山野之間
[00:00:08.400 --> 00:00:11.440]  空氣中加傘著微涼的氣息
[00:00:11.440 --> 00:00:13.880]  帶著些許樹葉的清香
[00:00:13.880 --> 00:00:16.640]  換性了還在沉睡的世界
[00:00:16.640 --> 00:00:20.000]  山坡上大片的草地
[00:00:20.000 --> 00:00:22.000]  像一片綠色的海洋
[00:00:22.000 --> 00:00:23.800]  微風吹過
[00:00:23.800 --> 00:00:26.000]  當起層層波紋
[00:00:26.000 --> 00:00:28.400]  草間上掛著露珠
[00:00:28.400 --> 00:00:31.400]  在陽光的應射下
[00:00:31.400 --> 00:00:33.400]  像無數經營的寶石
[00:00:33.400 --> 00:00:35.400]  閃爍著光灰



[00:00:00.000 --> 00:00:03.320]  秋天的清晨
[00:00:03.320 --> 00:00:04.440]  陽光透過寶物
[00:00:04.440 --> 00:00:06.280]  撒在涼過的山野之間
[00:00:06.280 --> 00:00:08.360]  空氣蹤加雜著威良的氣息
[00:00:08.360 --> 00:00:09.960]  帶著戲曲數夜的清香
[00:00:09.960 --> 00:00:12.000]  歡迎景了還在沉睡的世界
[00:00:12.000 --> 00:00:13.760]  山坡上大片的草地
[00:00:13.760 --> 00:00:15.040]  像一片綠色的海洋
[00:00:15.040 --> 00:00:17.240]  微風吹過 盪起層層波紋
[00:00:17.240 --> 00:00:19.000]  草尖上掛著露珠
[00:00:19.000 --> 00:00:20.400]  在陽光的映射下
[00:00:20.400 --> 00:00:22.000]  向無數科經營的保釋
[00:00:22.000 --> 00:00:23.000]  閃爍著光灰
[00:00:23.000 --> 00:00:26.200]  山腳下的河流 黃黃流糖
[00:00:26.200 --> 00:00:27.840]  水面清澈間地
[00:00:27.840 --> 00:00:30.040]  彷彿一面巨大的鏡子
[00:00:30.040 --> 00:00:31.640]  映照出天空的威攔
[00:00:31.640 --> 00:00:33.240]  和四周裡面的群山




[00:00:00.000 --> 00:00:04.080]  哈嘍 好久不见啊
[00:00:04.080 --> 00:00:06.480]  最近都在忙什么呢
[00:00:06.480 --> 00:00:09.880]  我最近一直在准备下个月的旅行
[00:00:09.880 --> 00:00:13.000]  打算去南部的海滩度假几天
[00:00:13.000 --> 00:00:14.720]  你有没有什么计划呀
[00:00:14.720 --> 00:00:19.000]  对了 我最近还在学习旁人
[00:00:19.000 --> 00:00:21.520]  试着做了一些新的菜饿
[00:00:21.520 --> 00:00:25.320]  上周末还做了一个大历面
[00:00:25.320 --> 00:00:26.520]  味道还不错
[00:00:26.520 --> 00:00:29.000]  你最近有没有尝试
[00:00:29.000 --> 00:00:31.000]  做什么新的菜品呢
[00:00:31.000 --> 00:00:34.000]  如果有的话一定要告诉我
[00:00:34.000 --> 00:00:38.000]  那外我最近还开始看了一本新书
[00:00:38.000 --> 00:00:42.000]  他讲的是一个精险的冒险故事
[00:00:42.000 --> 00:00:44.000]  真的很吸引人
[00:00:44.000 --> 00:00:46.000]  如果你也喜欢的话
[00:00:46.000 --> 00:00:48.000]  我可以推荐给你啊
[00:00:48.000 --> 00:00:50.000]  对了
[00:00:50.000 --> 00:00:55.000]  你知道最近周围有什么好玩的活动吗
[00:00:55.000 --> 00:00:58.000]  我周末想找一点新鲜的事情做
[00:00:58.000 --> 00:01:01.000]  好了 我得去忙了
[00:01:01.000 --> 00:01:04.000]  下次再聊 保持联系啊 拜拜
[00:01:04.000 --> 00:01:05.000]  你
